uTasker/uTasker-Kinetis/Applications/uTaskerV1.4/debug_hal_stm32.h
/**********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher

    ---------------------------------------------------------------------
    File:      debug_hal_stm32.h
    Project:   uTasker Demonstration project
               - hardware application layer for STM32
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2018
    *********************************************************************
    This file includes a number of hardware specific routines that are
    included in debug.c. This include file allows the main content of debug.c
    to be hardware independent and thus shared by all processor projects. 
    In addition it makes adding specific setups for different processor boards
    possible by exchanging this file or by including multiple sets of the
    routines in it, controlled by defines of each target type

*/


#if defined USE_MAINTENANCE && !defined REMOVE_PORT_INITIALISATIONS

// Check the present state of a particular port
//
extern int fnPortState(CHAR cPortBit)
{
    #if defined STM3241G_EVAL
    switch (cPortBit) {
    case '1':
        return (_READ_PORT_MASK(G, LED1) != 0);
    case '2':
        return (_READ_PORT_MASK(G, LED2) != 0);
    case '3':
        return (_READ_PORT_MASK(I, LED3) != 0);
    case '4':
        return (_READ_PORT_MASK(C, LED4) != 0);
    }
    #elif defined STM32F746G_DISCO
    switch (cPortBit) {
    case '1':
        return (_READ_PORT_MASK(I, LED1) != 0);
    case '2':
        return (_READ_PORT_MASK(I, LED2) != 0);
    case '3':
        return (_READ_PORT_MASK(I, LED3) != 0);
    case '4':
        return (_READ_PORT_MASK(I, LED4) != 0);
    }
    #elif defined WISDOM_STM32F407
    switch (cPortBit) {
    case '1':
        return (_READ_PORT_MASK(E, LED1) != 0);
    case '2':
        return (_READ_PORT_MASK(E, LED2) != 0);
    case '3':
        return (_READ_PORT_MASK(E, LED3) != 0);
    case '4':
        return (_READ_PORT_MASK(E, LED4) != 0);
    }
    #elif defined NUCLEO_F401RE
    switch (cPortBit) {
    case '1':
        return (_READ_PORT_MASK(A, LED1) != 0);
    case '2':
        return (_READ_PORT_MASK(A, LED2) != 0);
    case '3':
        return (_READ_PORT_MASK(A, LED3) != 0);
    case '4':
        return (_READ_PORT_MASK(A, LED4) != 0);
    }
    #elif defined STM3210C_EVAL
    switch (cPortBit) {
    case '1':
        return (_READ_PORT_MASK(D, LED4) != 0);
    case '2':
        return (_READ_PORT_MASK(D, LED3) != 0);
    case '3':
        return (_READ_PORT_MASK(D, LED1) != 0);
    case '4':
        return (_READ_PORT_MASK(D, LED2) != 0);
    }
    #elif defined STM32_P207 || defined STM32F407ZG_SK
    switch (cPortBit) {
    case '1':
        return (_READ_PORT_MASK(F, LED1) != 0);
    case '2':
        return (_READ_PORT_MASK(F, LED2) != 0);
    case '3':
        return (_READ_PORT_MASK(F, LED3) != 0);
    case '4':
        return (_READ_PORT_MASK(F, LED4) != 0);
    }
    #else                                                                // used when LEDs are all on the same port
    switch (cPortBit) {
        #if defined LED1
    case '1':
        if ((DEMO_INPUT_PORT & LED1) != 0) {
            return 1;
        }
        break;
        #endif
        #if defined LED2
    case '2':
        if ((DEMO_INPUT_PORT & LED2) != 0) {
            return 1;
        }
        break;
        #endif
        #if defined LED3
    case '3':
        if ((DEMO_INPUT_PORT & LED3) != 0) {
            return 1;
        }
        break;
        #endif
        #if defined LED4
    case '4':
        if ((DEMO_INPUT_PORT & LED4) != 0) {
            return 1;
        }
        break;
        #endif
    default:
        break;
    }
    #endif
    return 0;
}


// Check whether the port is configured as an input or as output
//
extern int fnPortInputConfig(CHAR cPortBit)
{
#if defined STM3210C_EVAL                                                // this device doesn't have a conventional DDR register
    switch (cPortBit) {
    case '1':
        if (GPIOD_CRL & 0x00030000) {                                    // PORTD_BIT4 [(1 << (4 * 4)) | (1 << ((4 * 4) + 1))]
            return 0;                                                    // configured as output
        }
        break;
    case '2':
        if (GPIOD_CRL & 0x00003000) {                                    // PORTD_BIT3 [(1 << (3 * 4)) | (1 << ((3 * 4) + 1))]
            return 0;
        }
        break;
    case '3':
        if (GPIOD_CRL & 0x30000000) {                                    // PORTD_BIT7 [(1 << (7 * 4)) | (1 << ((7 * 4) + 1))]
            return 0;
        }
        break;
    case '4':
        if (GPIOD_CRH & 0x00300000) {                                    // PORTD_BIT13 [(1 << (5 * 4)) | (1 << ((5 * 4) + 1))]
            return 0;
        }
        break;
    default:
        break;
    }
#elif defined WISDOM_STM32F407
    switch (cPortBit) {
    case '1':
        if ((GPIOE_MODER & 0x00030000) == 0x00010000) {                  // PORTE_BIT8 [(1 << (8 * 4)) | (1 << ((8 * 4) + 1))]
            return 0;                                                    // configured as output
        }
        break;
    case '2':
        if ((GPIOE_MODER & 0x000c0000) == 0x00040000) {                  // PORTE_BIT9 [(1 << (9 * 4)) | (1 << ((9 * 4) + 1))]
            return 0;
        }
        break;
    case '3':
        if ((GPIOE_MODER & 0x00300000) == 0x00100000) {                  // PORTE_BIT10 [(1 << (10 * 4)) | (1 << ((10 * 4) + 1))]
            return 0;
        }
        break;
    case '4':
        if ((GPIOE_MODER & 0x00c00000) == 0x00400000) {                  // PORTE_BIT11 [(1 << (11 * 4)) | (1 << ((11 * 4) + 1))]
            return 0;
        }
        break;
    default:
        break;
    }
#elif defined NUCLEO_F401RE
    switch (cPortBit) {
    case '1':
        if ((GPIOA_MODER & 0x00000c00) == 0x00000400) {                  // PORTA_BIT5 [(1 << (5 * 4)) | (1 << ((5 * 4) + 1))]
            return 0;                                                    // configured as output
        }
        break;
    case '2':
        if ((GPIOA_MODER & 0x00003000) == 0x00001000) {                  // PORTA_BIT6 [(1 << (6 * 4)) | (1 << ((6 * 4) + 1))]
            return 0;
        }
        break;
    case '3':
        if ((GPIOA_MODER & 0x0000c000) == 0x00004000) {                  // PORTA_BIT7 [(1 << (7 * 4)) | (1 << ((7 * 4) + 1))]
            return 0;
        }
        break;
    case '4':
        if ((GPIOA_MODER & 0x00030000) == 0x00010000) {                  // PORTA_BIT8 [(1 << (8 * 4)) | (1 << ((8 * 4) + 1))]
            return 0;
        }
        break;
    default:
        break;
    }
#elif defined STM3241G_EVAL
    switch (cPortBit) {
    case '1':
        if ((GPIOG_MODER & 0x00003000) == 0x00001000) {                  // PORTG_BIT6 [(1 << (6 * 2)) | (1 << ((6 * 2) + 1))]
            return 0;
        }
        break;
    case '2':
        if ((GPIOG_MODER & 0x00030000) == 0x00010000) {                  // PORTG_BIT8 [(1 << (8 * 2)) | (1 << ((8 * 2) + 1))]
            return 0;                                                    // configured as output
        }
        break;
    case '3':
        if ((GPIOI_MODER & 0x000c0000) == 0x00040000) {                  // PORTI_BIT9 [(1 << (9 * 2)) | (1 << ((9 * 2) + 1))]
            return 0;                                                    // configured as output
        }
        break;
    case '4':
        if ((GPIOC_MODER & 0x0000c000) == 0x00004000) {                  // PORTC_BIT7 [(1 << (7 * 2)) | (1 << ((7 * 2) + 1))]
            return 0;
        }
        break;
    }
#elif defined STM32F746G_DISCO
    switch (cPortBit) {
    case '1':
        if ((GPIOI_MODER & 0x0000000c) == 0x00000004) {                  // PORTI_BIT1 [(1 << (1 * 2)) | (1 << ((1 * 2) + 1))]
            return 0;
        }
        break;
    case '2':
        if ((GPIOI_MODER & 0x00000030) == 0x00000010) {                  // PORTI_BIT2 [(1 << (2 * 2)) | (1 << ((2 * 2) + 1))]
            return 0;                                                    // configured as output
        }
        break;
    case '3':
        if ((GPIOI_MODER & 0x000000c0) == 0x00000040) {                  // PORTI_BIT3 [(1 << (3 * 2)) | (1 << ((3 * 2) + 1))]
            return 0;                                                    // configured as output
        }
        break;
    case '4':
        if ((GPIOI_MODER & 0x00000300) == 0x00000100) {                  // PORTI_BIT4 [(1 << (4 * 2)) | (1 << ((4 * 2) + 1))]
            return 0;
        }
        break;
    }
#elif defined NUCLEO_F429ZI || defined NUCLEO_F746ZG
    switch (cPortBit) {
    case '1':
    #define _PORTBIT_IS_INPUT(ref, bit_number)  ((GPIO##ref##_MODER & ((1 << (bit_number * 2)) | ((1 << ((bit_number * 2) + 1))))) == (1 << (bit_number * 2)))
        if (_PORTBIT_IS_INPUT(B, 0) != 0) {                              // PORTB_BIT0
            return 0;                                                    // configured as output
        }
        break;
    case '2':
        if (_PORTBIT_IS_INPUT(B, 7) != 0) {                              // PORTB_BIT7
            return 0;                                                    // configured as output
        }
        break;
    case '3':
        if (_PORTBIT_IS_INPUT(B, 14) != 0) {                             // PORTB_BIT14
            return 0;                                                    // configured as output
        }
        break;
    default:
        break;
    }
#elif defined STM32_P207 || defined STM32F407ZG_SK
    switch (cPortBit) {
    case '1':
        if ((GPIOF_MODER & 0x00003000) == 0x00001000) {                  // PORTF_BIT6 [(1 << (6 * 2)) | (1 << ((6 * 2) + 1))]
            return 0;                                                    // configured as output
        }
        break;
    case '2':
        if ((GPIOF_MODER & 0x0000c000) == 0x00004000) {                  // PORTF_BIT7
            return 0;
        }
        break;
    case '3':
        if ((GPIOF_MODER & 0x00030000) == 0x00010000) {                  // PORTF_BIT8
            return 0;
        }
        break;
    case '4':
        if ((GPIOF_MODER & 0x000c0000) == 0x00040000) {                  // PORTF_BIT9
            return 0;
        }
        break;
    default:
        break;
    }
#elif defined NUCLEO_F429ZI || defined NUCLEO_L432KC || defined NUCLEO_L031K6 || defined NUCLEO_L011K4 || defined NUCLEO_F031K6 || defined NUCLEO_L496RG || defined NUCLEO_F746ZG
    switch (cPortBit) {
    case '1':
        if ((GPIOB_MODER & 0x00000030) == 0x00000010) {                  // PORTB_BIT3 [(1 << (3 * 2)) | (1 << ((3 * 2) + 1))]
            return 0;                                                    // configured as output
        }
        break;
    case '2':
        if ((GPIOB_MODER & 0x000000c0) == 0x00000040) {                  // PORTB_BIT4
            return 0;
        }
        break;
    case '3':
        if ((GPIOB_MODER & 0x00000300) == 0x00000100) {                  // PORTB_BIT5
            return 0;
        }
        break;
    default:
        break;
    }
#endif
    return 1;                                                            // configured as an input
}



