uTasker/uTasker-Kinetis/Applications/uTaskerV1.4/debug_hal_stm32.h
// Configure a processor port pin as input/output or analogue
//
extern int fnConfigPort(CHAR cPortBit, CHAR cType)
{
    cPortBit -= '0';                                                     // select bit offset

    switch (cType) {
    case 'd':                                                            // default use for 0..4
    case 'i':                                                            // port to be input
        switch (cPortBit) {
#if defined STM3241G_EVAL
        case 0:
            _CONFIG_PORT_INPUT(G, (LED1), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_1;     // set present bit as input
            break;
        case 1:
            _CONFIG_PORT_INPUT(G, (LED2), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_2;     // set present bit as input
            break;
        case 2:
            _CONFIG_PORT_INPUT(I, (LED3), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_3;     // set present bit as input
            break;
        case 3:
            _CONFIG_PORT_INPUT(C, (LED4), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_4;     // set present bit as input
            break;
#elif defined STM32F746G_DISCO
        case 0:
            _CONFIG_PORT_INPUT(I, (LED1), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_1;     // set present bit as input
            break;
        case 1:
            _CONFIG_PORT_INPUT(I, (LED2), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_2;     // set present bit as input
            break;
        case 2:
            _CONFIG_PORT_INPUT(I, (LED3), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_3;     // set present bit as input
            break;
        case 3:
            _CONFIG_PORT_INPUT(I, (LED4), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_4;     // set present bit as input
            break;
#elif defined WISDOM_STM32F407
        case 0:
            _CONFIG_PORT_INPUT(E, (LED1), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_1;     // set present bit as input
            break;
        case 1:
            _CONFIG_PORT_INPUT(E, (LED2), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_2;     // set present bit as input
            break;
        case 2:
            _CONFIG_PORT_INPUT(E, (LED3), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_3;     // set present bit as input
            break;
        case 3:
            _CONFIG_PORT_INPUT(E, (LED4), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_4;     // set present bit as input
            break;
#elif defined NUCLEO_F401RE
        case 0:
            _CONFIG_PORT_INPUT(A, (LED1), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_1;     // set present bit as input
            break;
        case 1:
            _CONFIG_PORT_INPUT(A, (LED2), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_2;     // set present bit as input
            break;
        case 2:
            _CONFIG_PORT_INPUT(A, (LED3), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_3;     // set present bit as input
            break;
        case 3:
            _CONFIG_PORT_INPUT(A, (LED4), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_4;     // set present bit as input
            break;
#elif defined ST_MB913C_DISCOVERY || defined ARDUINO_BLUE_PILL
        case 0:
            _CONFIG_PORT_INPUT(C, (DEMO_LED_2 << PORT_SHIFT), (INPUT_PULL_UP)); // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_2;     // set present bit as input
            break;
        case 1:
            _CONFIG_PORT_INPUT(C, (DEMO_LED_1 << PORT_SHIFT), (INPUT_PULL_UP)); // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_1;     // set present bit as input
            break;
#elif defined NUCLEO_F429ZI || defined NUCLEO_L432KC || defined NUCLEO_L031K6 || defined NUCLEO_L011K4 || defined NUCLEO_F031K6 || defined NUCLEO_L496RG || defined NUCLEO_F746ZG
        case 0:
            _CONFIG_PORT_INPUT(B, (LED1), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~0x01;           // set present bit as input
            break;
        case 1:
            _CONFIG_PORT_INPUT(B, (LED2), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~0x02;           // set present bit as input
            break;
        case 2:
            _CONFIG_PORT_INPUT(B, (LED3), (INPUT_PULL_UP));              // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~0x04;           // set present bit as input
            break;
#elif defined ST_MB997A_DISCOVERY
        case 0:
            _CONFIG_PORT_INPUT(D, (DEMO_LED_1 << PORT_SHIFT), (INPUT_PULL_UP));// configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_1;     // set present bit as input
            break;
        case 1:
            _CONFIG_PORT_INPUT(D, (DEMO_LED_2 << PORT_SHIFT), (INPUT_PULL_UP));// configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_2;      // set present bit as input
            break;
        case 2:
            _CONFIG_PORT_INPUT(D, (DEMO_LED_3 << PORT_SHIFT), (INPUT_PULL_UP));// configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_3;     // set present bit as input
            break;
        case 3:
            _CONFIG_PORT_INPUT(D, (DEMO_LED_4 << PORT_SHIFT), (INPUT_PULL_UP));// configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_4;     // set present bit as input
            break;
#elif defined STM32_P207 || defined STM32F407ZG_SK
        case 0:
            _CONFIG_PORT_INPUT(F, LED1, (INPUT_PULL_UP));                // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_1;     // set present bit as input
            break;
        case 1:
            _CONFIG_PORT_INPUT(F, LED2, (INPUT_PULL_UP));                // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_2;     // set present bit as input
            break;
        case 2:
            _CONFIG_PORT_INPUT(F, LED3, (INPUT_PULL_UP));                // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_3;     // set present bit as input
            break;
        case 3:
            _CONFIG_PORT_INPUT(F, LED4, (INPUT_PULL_UP));                // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_4;     // set present bit as input
            break;
#else                                                                    // STM3210C_EVAL
        case 0:
            _CONFIG_PORT_INPUT(D, LED4, (INPUT_PULL_UP));                // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_1;     // set present bit as input
            break;
        case 1:
            _CONFIG_PORT_INPUT(D, LED3, (INPUT_PULL_UP));                // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_2;     // set present bit as input
            break;
        case 2:
            _CONFIG_PORT_INPUT(D, LED1, (INPUT_PULL_UP));                // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_4;     // set present bit as input
            break;
        case 3:
            _CONFIG_PORT_INPUT(D, LED2, (INPUT_PULL_UP));                // configure as input with pull-up
            temp_pars->temp_parameters.ucUserOutputs &= ~DEMO_LED_3;     // set present bit as input
            break;
#endif
        default:
            break;
        }
        break;

    case 'o':                                                            // port to be output
        switch (cPortBit) {
#if defined STM3241G_EVAL
        case 0:
            _CONFIG_PORT_OUTPUT(G, (LED1), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_1;      // set present bit as output
            break;
        case 1:
            _CONFIG_PORT_OUTPUT(G, (LED2), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_2;     // set present bit as output
            break;
        case 2:
            _CONFIG_PORT_OUTPUT(I, (LED3), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_3;     // set present bit as output
            break;
        case 3:
            _CONFIG_PORT_OUTPUT(C, (LED4), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_4;     // set present bit as output
            break;
#elif defined STM32F746G_DISCO
        case 0:
            _CONFIG_PORT_OUTPUT(I, (LED1), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_1;      // set present bit as output
            break;
        case 1:
            _CONFIG_PORT_OUTPUT(I, (LED2), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_2;     // set present bit as output
            break;
        case 2:
            _CONFIG_PORT_OUTPUT(I, (LED3), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_3;     // set present bit as output
            break;
        case 3:
            _CONFIG_PORT_OUTPUT(I, (LED4), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_4;     // set present bit as output
            break;
#elif defined WISDOM_STM32F407
        case 0:
            _CONFIG_PORT_OUTPUT(E, (LED1), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_1;      // set present bit as output
            break;
        case 1:
            _CONFIG_PORT_OUTPUT(E, (LED2), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_2;     // set present bit as output
            break;
        case 2:
            _CONFIG_PORT_OUTPUT(E, (LED3), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_3;     // set present bit as output
            break;
        case 3:
            _CONFIG_PORT_OUTPUT(E, (LED4), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_4;     // set present bit as output
            break;
#elif defined NUCLEO_F401RE
        case 0:
            _CONFIG_PORT_OUTPUT(A, (LED1), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_1;      // set present bit as output
            break;
        case 1:
            _CONFIG_PORT_OUTPUT(A, (LED2), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_2;     // set present bit as output
            break;
        case 2:
            _CONFIG_PORT_OUTPUT(A, (LED3), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_3;     // set present bit as output
            break;
        case 3:
            _CONFIG_PORT_OUTPUT(A, (LED4), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_4;     // set present bit as output
            break;

#elif defined ST_MB913C_DISCOVERY || defined ARDUINO_BLUE_PILL
        case 0:
            _CONFIG_PORT_OUTPUT(C, (DEMO_LED_2 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_2;      // set present bit as output
            break;
        case 1:
            _CONFIG_PORT_OUTPUT(C, (DEMO_LED_1 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_1;      // set present bit as output
            break;
#elif defined NUCLEO_F429ZI || defined NUCLEO_L432KC || defined NUCLEO_L031K6 || defined NUCLEO_L011K4 || defined NUCLEO_F031K6 || defined NUCLEO_L496RG || defined NUCLEO_F746ZG
        case 0:
            _CONFIG_PORT_OUTPUT(B, (LED1), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= 0x01;            // set present bit as output
            break;
        case 1:
            _CONFIG_PORT_OUTPUT(B, (LED2), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= 0x02;            // set present bit as output
            break;
        case 2:
            _CONFIG_PORT_OUTPUT(B, (LED3), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= 0x04;            // set present bit as output
            break;
#elif defined ST_MB997A_DISCOVERY
        case 0:
            _CONFIG_PORT_OUTPUT(D, (DEMO_LED_1 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_1;      // set present bit as output
            break;
        case 1:
            _CONFIG_PORT_OUTPUT(D, (DEMO_LED_2 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_2;      // set present bit as output
            break;
        case 2:
            _CONFIG_PORT_OUTPUT(D, (DEMO_LED_3 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_3;      // set present bit as output
            break;
        case 3:
            _CONFIG_PORT_OUTPUT(D, (DEMO_LED_4 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)) // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_4;      // set present bit as output
            break;
#elif defined STM32_P207 || defined STM32F407ZG_SK
        case 0:
            _CONFIG_PORT_OUTPUT(F, (DEMO_LED_1 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_1;      // set present bit as output
            break;
        case 1:
            _CONFIG_PORT_OUTPUT(F, (DEMO_LED_2 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_2;      // set present bit as output
            break;
        case 2:
            _CONFIG_PORT_OUTPUT(F, (DEMO_LED_3 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_3;      // set present bit as output
            break;
        case 3:
            _CONFIG_PORT_OUTPUT(F, (DEMO_LED_4 << PORT_SHIFT), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_4;      // set present bit as output
            break;
#else                                                                    // STM3210C_EVAL
        case 0:
            _CONFIG_PORT_OUTPUT(D, LED4, (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_1;      // set present bit as output
            break;
        case 1:
            _CONFIG_PORT_OUTPUT(D, LED3, (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_2;      // set present bit as output
            break;
        case 2:
            _CONFIG_PORT_OUTPUT(D, LED1, (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_4;      // set present bit as output
            break;
        case 3:
            _CONFIG_PORT_OUTPUT(D, LED2, (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); // configure as medium speed output with push-pull output
            temp_pars->temp_parameters.ucUserOutputs |= DEMO_LED_3;      // set present bit as output
            break;
#endif
        default:
            break;
        }
        break;

    case 'a':                                                            // port to be analog
        break;

    default:
        return -1;
    }
    return 0;
}


// Set a single output to logical '1' or '0' state
//
static void fnSetPortBit(unsigned short usBit, int iSetClr)
{
    #if !defined STM32_P207 && !defined STM32F407ZG_SK && !defined NUCLEO_F429ZI && !defined NUCLEO_L432KC && !defined NUCLEO_L031K6 && !defined NUCLEO_L011K4 && !defined NUCLEO_F031K6 && !defined NUCLEO_L496RG && !defined NUCLEO_F746ZG
        #if defined STM3241G_EVAL || defined WISDOM_STM32F407 || defined NUCLEO_F401RE || defined STM32F746G_DISCO
    POWER_UP_USER_PORTS();                                               // ensure that the used ports are powered up before used
        #endif
    if (iSetClr != 0) {
        switch (usBit) {
        case 0x0001:
            USER_PORT_1 |= USER_PORT_1_BIT;
            break;
        case 0x0002:
            USER_PORT_2 |= USER_PORT_2_BIT;
            break;
        case 0x0004:
            USER_PORT_3 |= USER_PORT_3_BIT;
            break;
        case 0x0008:
            USER_PORT_4 |= USER_PORT_4_BIT;
            break;
        case 0x0010:
            USER_PORT_5 |= USER_PORT_5_BIT;
            break;
        case 0x0020:
            USER_PORT_6 |= USER_PORT_6_BIT;
            break;
        case 0x0040:
            USER_PORT_7 |= USER_PORT_7_BIT;
            break;
        case 0x0080:
            USER_PORT_8 |= USER_PORT_8_BIT;
            break;
        case 0x0100:
            USER_PORT_9 |= USER_PORT_9_BIT;
            break;
        case 0x0200:
            USER_PORT_10 |= USER_PORT_10_BIT;
            break;
        case 0x0400:
            USER_PORT_11 |= USER_PORT_11_BIT;
            break;
        case 0x0800:
            USER_PORT_12 |= USER_PORT_12_BIT;
            break;
        case 0x1000:
            USER_PORT_13 |= USER_PORT_13_BIT;
            break;
        case 0x2000:
            USER_PORT_14 |= USER_PORT_14_BIT;
            break;
        case 0x4000:
            USER_PORT_15 |= USER_PORT_15_BIT;
            break;
        case 0x8000:
            USER_PORT_16 |= USER_PORT_16_BIT;
            break;
        }
    }
    else {
        switch (usBit) {
        case 0x0001:
            USER_PORT_1 &= ~USER_PORT_1_BIT;
            break;
        case 0x0002:
            USER_PORT_2 &= ~USER_PORT_2_BIT;
            break;
        case 0x0004:
            USER_PORT_3 &= ~USER_PORT_3_BIT;
            break;
        case 0x0008:
            USER_PORT_4 &= ~USER_PORT_4_BIT;
            break;
        case 0x0010:
            USER_PORT_5 &= ~USER_PORT_5_BIT;
            break;
        case 0x0020:
            USER_PORT_6 &= ~USER_PORT_6_BIT;
            break;
        case 0x0040:
            USER_PORT_7 &= ~USER_PORT_7_BIT;
            break;
        case 0x0080:
            USER_PORT_8 &= ~USER_PORT_8_BIT;
            break;
        case 0x0100:
            USER_PORT_9 &= ~USER_PORT_9_BIT;
            break;
        case 0x0200:
            USER_PORT_10 &= ~USER_PORT_10_BIT;
            break;
        case 0x0400:
            USER_PORT_11 &= ~USER_PORT_11_BIT;
            break;
        case 0x0800:
            USER_PORT_12 &= ~USER_PORT_12_BIT;
            break;
        case 0x1000:
            USER_PORT_13 &= ~USER_PORT_13_BIT;
            break;
        case 0x2000:
            USER_PORT_14 &= ~USER_PORT_14_BIT;
            break;
        case 0x4000:
            USER_PORT_15 &= ~USER_PORT_15_BIT;
            break;
        case 0x8000:
            USER_PORT_16 &= ~USER_PORT_16_BIT;
            break;
        }
    }                                                                    _SIM_PORTS; // ensure the simulator updates its port states
    #endif
}


