uTasker/uTasker-Kinetis/Applications/uTaskerV1.4/debug_hal_stm32.h
// Request present logic level of an output
//
extern int fnUserPortState(CHAR cPortBit)
{
    #if !defined STM32_P207 && !defined STM32F407ZG_SK && !defined NUCLEO_F429ZI && !defined NUCLEO_L432KC && !defined NUCLEO_L031K6 && !defined NUCLEO_L011K4 && !defined NUCLEO_F031K6 && !defined NUCLEO_L496RG && !defined NUCLEO_F746ZG
    switch (cPortBit) {
    case 'a':
        return ((USER_PORT_1 & USER_PORT_1_BIT) != 0);
    case 'b':
        return ((USER_PORT_2 & USER_PORT_2_BIT) != 0);
    case 'c':
        return ((USER_PORT_3 & USER_PORT_3_BIT) != 0);
    case 'd':
        return ((USER_PORT_4 & USER_PORT_4_BIT) != 0);
    case 'e':
        return ((USER_PORT_5 & USER_PORT_5_BIT) != 0);
    case 'f':
        return ((USER_PORT_6 & USER_PORT_6_BIT) != 0);
    case 'g':
        return ((USER_PORT_7 & USER_PORT_7_BIT) != 0);
    case 'h':
        return ((USER_PORT_8 & USER_PORT_8_BIT) != 0);
    case 'i':
        return ((USER_PORT_9 & USER_PORT_9_BIT) != 0);
    case 'j':
        return ((USER_PORT_10 & USER_PORT_10_BIT) != 0);
    case 'k':
        return ((USER_PORT_11 & USER_PORT_11_BIT) != 0);
    case 'l':
        return ((USER_PORT_12 & USER_PORT_12_BIT) != 0);
    case 'm':
        return ((USER_PORT_13 & USER_PORT_13_BIT) != 0);
    case 'n':
        return ((USER_PORT_14 & USER_PORT_14_BIT) != 0);
    case 'o':
        return ((USER_PORT_15 & USER_PORT_15_BIT) != 0);
    case 'p':
        return ((USER_PORT_16 & USER_PORT_16_BIT) != 0);
    default:
        break;
    }
#endif
    return 0;
}

// Configure port bit as output (a..p are port bit references)
//
static int fnConfigOutputPort(CHAR cPortBit)
{
    #if !defined STM32_P207 && !defined STM32F407ZG_SK && !defined NUCLEO_F429ZI && !defined NUCLEO_L432KC && !defined NUCLEO_L031K6 && !defined NUCLEO_L011K4 && !defined NUCLEO_F031K6 && !defined NUCLEO_L496RG && !defined NUCLEO_F746ZG
    switch (cPortBit) {
    case 'a':
        CONFIG_USER_PORT_1();
        break;
    case 'b':
        CONFIG_USER_PORT_2();
        break;
    case 'c':
        CONFIG_USER_PORT_3();
        break;
    case 'd':
        CONFIG_USER_PORT_4();
        break;
    case 'e':
        CONFIG_USER_PORT_5();
        break;
    case 'f':
        CONFIG_USER_PORT_6();
        break;
    case 'g':
        CONFIG_USER_PORT_7();
        break;
    case 'h':
        CONFIG_USER_PORT_8();
        break;
    case 'i':
        CONFIG_USER_PORT_9();
        break;
    case 'j':
        CONFIG_USER_PORT_10();
        break;
    case 'k':
        CONFIG_USER_PORT_11();
        break;
    case 'l':
        CONFIG_USER_PORT_12();
        break;
    case 'm':
        CONFIG_USER_PORT_13();
        break;
    case 'n':
        CONFIG_USER_PORT_14();
        break;
    case 'o':
        CONFIG_USER_PORT_15();
        break;
    case 'p':
        CONFIG_USER_PORT_16();
        break;
    default:
        return 1;
    }                                                                    _SIM_PORTS; // ensure the simulator updates its port states
    #endif
    return 0;
}


// Toggle the state of an output port
//
extern int fnTogglePortOut(CHAR cPortBit)
{
    #if !defined STM32_P207 && !defined STM32F407ZG_SK && !defined NUCLEO_F429ZI && !defined NUCLEO_L432KC && !defined NUCLEO_L031K6 && !defined NUCLEO_L011K4 && !defined NUCLEO_F031K6 && !defined NUCLEO_L496RG && !defined NUCLEO_F746ZG
    switch (cPortBit) {
    case 'a':
        USER_PORT_1 ^= USER_PORT_1_BIT;
        break;
    case 'b':
        USER_PORT_2 ^= USER_PORT_2_BIT;
        break;
    case 'c':
        USER_PORT_3 ^= USER_PORT_3_BIT;
        break;
    case 'd':
        USER_PORT_4 ^= USER_PORT_4_BIT;
        break;
    case 'e':
        USER_PORT_5 ^= USER_PORT_5_BIT;
        break;
    case 'f':
        USER_PORT_6 ^= USER_PORT_6_BIT;
        break;
    case 'g':
        USER_PORT_7 ^= USER_PORT_7_BIT;
        break;
    case 'h':
        USER_PORT_8 ^= USER_PORT_8_BIT;
        break;
    case 'i':
        USER_PORT_9 ^= USER_PORT_9_BIT;
        break;
    case 'j':
        USER_PORT_10 ^= USER_PORT_10_BIT;
        break;
    case 'k':
        USER_PORT_11 ^= USER_PORT_11_BIT;
        break;
    case 'l':
        USER_PORT_12 ^= USER_PORT_12_BIT;
        break;
    case 'm':
        USER_PORT_13 ^= USER_PORT_13_BIT;
        break;
    case 'n':
        USER_PORT_14 ^= USER_PORT_14_BIT;
        break;
    case 'o':
        USER_PORT_15 ^= USER_PORT_15_BIT;
        break;
    case 'p':
        USER_PORT_16 ^= USER_PORT_16_BIT;
        break;
    default:
        break;
    }
    temp_pars->temp_parameters.usUserDefinedOutputs ^= (0x0001 << (cPortBit - 'a'));

    _SIM_PORTS;                                                          // ensure the simulator updates its port states
    #endif
    return 0;
}

// Write a value to a group of output bits grouped as a byte
//
extern void fnSetPortOut(unsigned char ucPortOutputs, int iInitialisation)
{
    #if defined STM3241G_EVAL || defined WISDOM_STM32F407 || defined NUCLEO_F401RE || defined STM32F746G_DISCO
    unsigned char ucBit = 0x01;
    while (ucBit != 0) {                                                 // for each possible output
        if (DEMO_USER_PORTS & ucBit) {                                   // if the port bit is to be an output
            switch (ucBit) {
            case DEMO_LED_1:
                if (iInitialisation != 0) {
                    POWER_UP(AHB1, RCC_AHB1ENR_GPIOGEN);                 // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_1) {
                    _SETBITS(G, LED1);
                }
                else {
                    _CLEARBITS(G, LED1);
                }
                break;
            case DEMO_LED_2:
                if (iInitialisation != 0) {
                    POWER_UP(AHB1, RCC_AHB1ENR_GPIOGEN);                 // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_2) {
                    _SETBITS(G, LED2);
                }
                else {
                    _CLEARBITS(G, LED2);
                }
                break;
            case DEMO_LED_3:
                if (iInitialisation != 0) {
                    POWER_UP(AHB1, RCC_AHB1ENR_GPIOIEN);                 // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_3) {
                    _SETBITS(I, LED3);
                }
                else {
                    _CLEARBITS(I, LED3);
                }
                break;
            case DEMO_LED_4:
                if (iInitialisation != 0) {
                    POWER_UP(AHB1, RCC_AHB1ENR_GPIOCEN);                 // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_4) {
                    _SETBITS(C, LED4);
                }
                else {
                    _CLEARBITS(C, LED4);
                }
                break;
            }
        }
        ucBit <<= 1;
    }
    #elif defined NUCLEO_F429ZI || defined NUCLEO_L432KC || defined NUCLEO_L031K6 || defined NUCLEO_L011K4 || defined NUCLEO_F031K6 || defined NUCLEO_L496RG || defined NUCLEO_F746ZG
    unsigned char ucBit = 0x01;
    while (ucBit != 0) {                                                 // for each possible output
        if ((0x07 & ucBit) != 0) {                                       // if the port bit is to be an output
            switch (ucBit) {
            case 0x01:
                if (iInitialisation != 0) {
                    __POWER_UP_GPIO(B);                                  // ensure port is powered up
                }
                if ((ucPortOutputs & 0x01) != 0) {
                    _SETBITS(B, LED1);
                }
                else {
                    _CLEARBITS(B, LED1);
                }
                break;
            case 0x02:
                if (iInitialisation != 0) {
                    __POWER_UP_GPIO(B);                                  // ensure port is powered up
                }
                if ((ucPortOutputs & 0x02) != 0) {
                    _SETBITS(B, LED2);
                }
                else {
                    _CLEARBITS(B, LED2);
                }
                break;
            case 0x04:
                if (iInitialisation != 0) {
                    __POWER_UP_GPIO(B);                                  // ensure port is powered up
                }
                if ((ucPortOutputs & 0x04) != 0) {
                    _SETBITS(B, LED3);
                }
                else {
                    _CLEARBITS(B, LED3);
                }
                break;
            }
        }
        ucBit <<= 1;
    }
    #elif defined STM3210C_EVAL
    unsigned char ucBit = 0x01;
    while (ucBit != 0) {                                                 // for each possible output
        if (DEMO_USER_PORTS & ucBit) {                                   // if the port bit is to be an output
            switch (ucBit) {
            case DEMO_LED_1:
                if (iInitialisation != 0) {
                    POWER_UP(APB2, RCC_APB2ENR_IOPDEN);                  // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_1) {
                    _SETBITS(D, LED4);
                }
                else {
                    _CLEARBITS(D, LED4);
                }
                break;
            case DEMO_LED_2:
                if (iInitialisation != 0) {
                    POWER_UP(APB2, RCC_APB2ENR_IOPDEN);                  // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_2) {
                    _SETBITS(D, LED3);
                }
                else {
                    _CLEARBITS(D, LED3);
                }
                break;
            case DEMO_LED_3:
                if (iInitialisation != 0) {
                    POWER_UP(APB2, RCC_APB2ENR_IOPDEN);                  // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_3) {
                    _SETBITS(D, LED1);
                }
                else {
                    _CLEARBITS(D, LED1);
                }
                break;
            case DEMO_LED_4:
                if (iInitialisation != 0) {
                    POWER_UP(APB2, RCC_APB2ENR_IOPDEN);                  // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_4) {
                    _SETBITS(D, LED2);
                }
                else {
                    _CLEARBITS(D, LED2);
                }
                break;
            }
        }
        ucBit <<= 1;
    }
    #elif defined STM32_P207 || defined STM32F407ZG_SK
    unsigned char ucBit = 0x01;
    while (ucBit != 0) {                                                 // for each possible output
        if (DEMO_USER_PORTS & ucBit) {                                   // if the port bit is to be an output
            switch (ucBit) {
            case DEMO_LED_1:
                if (iInitialisation != 0) {
                    POWER_UP(AHB1, RCC_AHB1ENR_GPIOFEN);                 // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_1) {
                    _SETBITS(F, LED1);
                }
                else {
                    _CLEARBITS(F, LED1);
                }
                break;
            case DEMO_LED_2:
                if (iInitialisation != 0) {
                    POWER_UP(AHB1, RCC_AHB1ENR_GPIOFEN);                 // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_2) {
                    _SETBITS(F, LED2);
                }
                else {
                    _CLEARBITS(F, LED2);
                }
                break;
            case DEMO_LED_3:
                if (iInitialisation != 0) {
                    POWER_UP(AHB1, RCC_AHB1ENR_GPIOFEN);                 // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_3) {
                    _SETBITS(F, LED3);
                }
                else {
                    _CLEARBITS(F, LED3);
                }
                break;
            case DEMO_LED_4:
                if (iInitialisation != 0) {
                    POWER_UP(AHB1, RCC_AHB1ENR_GPIOFEN);                 // ensure port is powered up
                }
                if (ucPortOutputs & DEMO_LED_4) {
                    _SETBITS(F, LED4);
                }
                else {
                    _CLEARBITS(F, LED4);
                }
                break;
            }
        }
        ucBit <<= 1;
    }
    #else
    ENABLE_LED_PORT();                                                   // ensure port is clocked and not in reset
    DEMO_LED_PORT &= ~DEMO_USER_PORTS;                                   // mask port bits
    DEMO_LED_PORT |= (ucPortOutputs & DEMO_USER_PORTS);                  // set initial output state
    #endif
}
#endif                                                                   // end USE_MAINTENANCE

#if defined EZPORT_CLONER

#define EZRESETOUT PORTA_BIT0
#define EZCSOUT    PORTA_BIT1
#define EZDIN      PORTA_BIT2
#define EZDOUT     PORTA_BIT3
#define EZCLKOUT   PORTA_BIT4

