uTasker/uTasker-Kinetis/Applications/uTaskerV1.4/debug_hal_stm32.h
// Send and receive a single byte
//
static unsigned char fnSendEZPORT(unsigned char ucDataOut)
{
    unsigned char ucBit = 0x80;                                          // data sent and receive most significant bit first
    unsigned char ucReadByte = 0;
    do {
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        if (ucDataOut & ucBit) {                                         // set new data output state
             _SETBITS(A, EZDOUT);
        }
        else {
             _CLEARBITS(A, EZDOUT);
        }
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _CLEARBITS(A, EZCLKOUT);                                         // falling clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        _SETBITS(A, EZCLKOUT);                                           // rising clock edge
        if (_READ_PORT_MASK(A, EZDIN)) {                                 // read data in
            ucReadByte |= ucBit;
        }
        ucBit >>= 1;
    } while (ucBit != 0);
    return ucReadByte;
}

static void fnConfigEz(void)
{
    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, (EZRESETOUT | EZCSOUT | EZDOUT | EZCLKOUT), (OUTPUT_SLOW | OUTPUT_PUSH_PULL),  (EZDOUT | EZCLKOUT));
    _CONFIG_PORT_INPUT(A, (EZDIN), (INPUT_PULL_UP));
}

static void fnNegateResetEz(void)                                        // remove reset with ezport chip select asserted
{
    _SETBITS(A, EZRESETOUT);                                             // negate the reset line
    fnDelayLoop(1);                                                      // delay for the chip select to be latched
    _SETBITS(A, EZCSOUT);                                                // negate ezport chip select
}

static void fnGetStatusEz(void)
{
    _CLEARBITS(A, EZCSOUT);                                              // assert ezport chip select - clock always starts at '1'
    fnDebugMsg("EZPORT status = ");
    fnSendEZPORT(EZCOMMAND_RDSR);                                        // command status read
    fnDebugHex(fnSendEZPORT(0xff), (sizeof(unsigned char) | WITH_LEADIN | WITH_CR_LF)); // clock in status read and display value
    _SETBITS(A, EZCSOUT);                                                // terminate sequence
}

