uTasker/uTasker-Kinetis/Applications/uTaskerV1.4/debug_hal_stm32.h
static void fnPrepareEz(CHAR *ptrInput)
{
    unsigned long ulClockSpeed = 25000000;                               // default clock speed 25MHz if nothing else entered
    unsigned char ucConfigSetting;
    if (*ptrInput != 0) {                                                // if a clock speed it passed, we calculate the correct setting for it
        ulClockSpeed = fnDecStrHex(ptrInput);                            // extract the speed in MHz
        ulClockSpeed *= 1000000;
    }
    ucConfigSetting = (unsigned char)((ulClockSpeed/2)/185000);          // the divisor needed to get around 200k (not less that 150k and not more than 200k)
    _CLEARBITS(D, EZCSOUT);                                              // assert ezport chip select - clock always starts at '1'
    fnSendEZPORT(EZCOMMAND_WRCR);                                        // start commanding configuration value
    fnDebugMsg("EZPORT configured with ");
    fnSendEZPORT(ucConfigSetting);                                       // send configuration value
    fnDebugHex(ucConfigSetting, (sizeof(unsigned char) | WITH_LEADIN | WITH_CR_LF));
    _SETBITS(D, EZCSOUT);                                                // terminate sequence
    fnDoHardware(DO_EZSTATUS , 0);                                       // show new status
}

static void fnBulkEraseEz(void)
{
    _CLEARBITS(D, EZCSOUT);                                              // assert ezport chip select - clock always starts at '1'
    fnSendEZPORT(EZCOMMAND_BE);
    _SETBITS(D, EZCSOUT);                                                // terminate sequence
    fnDebugMsg("EZPORT bulk erase issued\r\n");
}

static void fnWriteEz(CHAR *ptrInput)
{
    if (*ptrInput != 0) {                                                // if a clock speed it passed, we calculate the correct setting for it
        unsigned char ucValue;
        _CLEARBITS(D, EZCSOUT);                                          // assert ezport chip select - clock always starts at '1'
        ucValue = (unsigned char)fnHexStrHex(ptrInput);
        fnSendEZPORT(ucValue);
        fnDebugHex(ucValue, (sizeof(unsigned char) | WITH_LEADIN));
        fnDebugMsg(" written\r\n");
        _SETBITS(D, EZCSOUT);                                            // terminate sequence
        fnDoHardware(DO_EZSTATUS , 0);                                   // show new status
    }
    else {
        fnDebugMsg("Value missing!\r\n");
    }
}
#endif

// Determine the cause of the last reset
//
extern unsigned char fnAddResetCause(CHAR *ptrBuffer)
{
    static unsigned long ulRCC_CSR     = 0xffffffff;
    static const CHAR cIndependentWD[] = "WDOG";
    static const CHAR cWindowWD[]      = "W-WDOG";
    static const CHAR cPowerOn[]       = "Power-on";
    static const CHAR cSoftware[]      = "Software";
    static const CHAR cLowPower[]      = "Low power";
    static const CHAR cPinReset[]      = "Reset pin";
    #if defined RCC_CSR_FWRSTF
    static const CHAR cFirwallReset[]  = "Firewall";
    #endif
    #if defined RCC_CSR_OBLRSTF
    static const CHAR cOBLReset[]      = "OBL";
    #endif
    #if defined RCC_CSR_V18PWRRSTF
    static const CHAR cV18PwrReset[]   = "V1.8";
    #endif
    static const CHAR cUnknown[]       = "???";
    const CHAR *ptrStr;
    if (ulRCC_CSR == 0xffffffff) {
        ulRCC_CSR = RCC_CSR;                                             // store the value for following requests
        RCC_CSR |= (RCC_CSR_RMVF);                                       // clear flags ready for next reset
    #if defined _WINDOWS
        RCC_CSR &= ~(RESET_CAUSE_FLAGS);
    #endif
    }

    if ((ulRCC_CSR & RCC_CSR_PORRSTF) != 0) {                            // power-on reset
        ptrStr = cPowerOn;
    }
    else if ((ulRCC_CSR & RCC_CSR_PINRSTF) != 0) {                       // reset pin
        ptrStr = cPinReset;
    }
    #if defined RCC_CSR_FWRSTF
    else if ((ulRCC_CSR & RCC_CSR_FWRSTF) != 0) {                        // firewall reset
        ptrStr = cFirwallReset;
    }
    #endif
    #if defined RCC_CSR_OBLRSTF
    else if ((ulRCC_CSR & RCC_CSR_OBLRSTF) != 0) {                       // options byte loading reset
        ptrStr = cOBLReset;
    }
    #endif
    #if defined RCC_CSR_V18PWRRSTF
    else if ((ulRCC_CSR & RCC_CSR_V18PWRRSTF) != 0) {                    // 1.8V domain reset
        ptrStr = cV18PwrReset;
    }
    #endif
    else if ((ulRCC_CSR & RCC_CSR_SFTRSTF) != 0) {                       // software commanded reset
        ptrStr = cSoftware;
    }
    else if ((ulRCC_CSR & RCC_CSR_IWDGRSTF) != 0) {                      // independent watchdog
        ptrStr = cIndependentWD;
    }
    else if ((ulRCC_CSR & RCC_CSR_WWDGRSTF) != 0) {                      // window watchdog
        ptrStr = cWindowWD;
    }
    else if ((ulRCC_CSR & RCC_CSR_LPWRRSTF) != 0) {                      // low-power reset
        ptrStr = cLowPower;
    }
    else {                                                               // unexpected
        ptrStr = cUnknown;
    }
    if (ptrBuffer == 0) {
        fnDebugMsg((CHAR *)ptrStr);
        return 0;
    }
    return (uStrcpy(ptrBuffer, ptrStr) - ptrBuffer);                     // return the length of the string
}

#if defined SUPPORT_LOW_POWER
// Display the low power modes that the processor offers and show presently active one
//
extern void fnShowLowPowerMode(void)
{
}
#endif
